Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ2064DAB169.atdf
         <register caption="" name="U6CTSR" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U6CTSR" />
         </register>
         <register caption="" name="SDI1R" offset="0x98" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI1R" />
         </register>
         <register caption="" name="SS1R" offset="0x9c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS1R" />
         </register>
         <register caption="" name="SDI2R" offset="0xa4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI2R" />
         </register>
         <register caption="" name="SS2R" offset="0xa8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS2R" />
         </register>
         <register caption="" name="SDI3R" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI3R" />
         </register>
         <register caption="" name="SS3R" offset="0xb4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS3R" />
         </register>
         <register caption="" name="SDI4R" offset="0xbc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI4R" />
         </register>
         <register caption="" name="SS4R" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS4R" />
         </register>
         <register caption="" name="SDI5R" offset="0xc8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI5R" />
         </register>
         <register caption="" name="SS5R" offset="0xcc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS5R" />
         </register>
         <register caption="" name="SDI6R" offset="0xd4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI6R" />
         </register>
         <register caption="" name="SS6R" offset="0xd8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS6R" />
         </register>
         <register caption="" name="C1RXR" offset="0xdc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="C1RXR" />
         </register>
         <register caption="" name="C2RXR" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="C2RXR" />
         </register>
         <register caption="" name="REFCLKI1R" offset="0xe4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="REFCLKI1R" />
         </register>
         <register caption="" name="REFCLKI3R" offset="0xec" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="REFCLKI3R" />
         </register>
         <register caption="" name="REFCLKI4R" offset="0xf0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="REFCLKI4R" />
         </register>
      </register-group>
   </module>
   <module caption="" id="01423" name="RPOUT" version="">
      <register-group name="RPOUT">
         <register caption="" name="RPA14R" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA14R" />
         </register>
         <register caption="" name="RPA15R" offset="0x4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA15R" />
         </register>
         <register caption="" name="RPB0R" offset="0x8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB0R" />
         </register>
         <register caption="" name="RPB1R" offset="0xc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB1R" />
         </register>
         <register caption="" name="RPB2R" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB2R" />
         </register>
         <register caption="" name="RPB3R" offset="0x14" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB3R" />
         </register>
         <register caption="" name="RPB5R" offset="0x1c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB5R" />
         </register>
         <register caption="" name="RPB6R" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB6R" />
         </register>
         <register caption="" name="RPB7R" offset="0x24" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB7R" />
         </register>
         <register caption="" name="RPB8R" offset="0x28" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB8R" />
         </register>
         <register caption="" name="RPB9R" offset="0x2c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB9R" />
         </register>
         <register caption="" name="RPB10R" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB10R" />
         </register>
         <register caption="" name="RPB14R" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB14R" />
         </register>
         <register caption="" name="RPB15R" offset="0x44" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB15R" />
         </register>
         <register caption="" name="RPC1R" offset="0x4c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC1R" />
         </register>
         <register caption="" name="RPC2R" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC2R" />
         </register>
         <register caption="" name="RPC3R" offset="0x54" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC3R" />
         </register>
         <register caption="" name="RPC4R" offset="0x58" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC4R" />
         </register>
         <register caption="" name="RPC13R" offset="0x7c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC13R" />
         </register>
         <register caption="" name="RPC14R" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC14R" />
         </register>
