Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ2064DAB169.atdf
      <value-group caption="DMA Transfer Mode bit" name="USBDMA8C__DMAMODE">
         <value caption="DMA Mode1 Transfers" name="" value="0x1" />
         <value caption="DMA Mode0 Transfers" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Interrupt Enable bit" name="USBDMA8C__DMAIE">
         <value caption="Interrupt is enabled for this channel" name="" value="0x1" />
         <value caption="Interrupt is disabled for this channel" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Error bit" name="USBDMA8C__DMAERR">
         <value caption="A bus error has been observed on the input" name="" value="0x1" />
         <value caption="The software writes this to clear the error" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Burst Mode Selection bit" name="USBDMA8C__DMABRSTM">
         <value caption="Burst Mode 3: INCR16" name="" value="0x3" />
         <value caption="Burst Mode 2: INCR8" name="" value="0x2" />
         <value caption="Burst Mode 1: INCR4 or unspecified length" name="" value="0x1" />
         <value caption="Burst Mode 0: Bursts of unspecified length" name="" value="0x0" />
      </value-group>
      <value-group caption="RX Endpoint 1 Double Packet Buffer Disable bits" name="USBDPBFD__EP1RXD">
         <value caption="RX double packet buffering is disabled for endpoint x" name="" value="0x1" />
         <value caption="RX double packet buffering is enabled for endpoint x" name="" value="0x0" />
      </value-group>
      <value-group caption="RX Endpoint 2 Double Packet Buffer Disable bits" name="USBDPBFD__EP2RXD">
         <value caption="RX double packet buffering is disabled for endpoint x" name="" value="0x1" />
         <value caption="RX double packet buffering is enabled for endpoint x" name="" value="0x0" />
      </value-group>
      <value-group caption="RX Endpoint 3 Double Packet Buffer Disable bits" name="USBDPBFD__EP3RXD">
         <value caption="RX double packet buffering is disabled for endpoint x" name="" value="0x1" />
         <value caption="RX double packet buffering is enabled for endpoint x" name="" value="0x0" />
      </value-group>
      <value-group caption="RX Endpoint 4 Double Packet Buffer Disable bits" name="USBDPBFD__EP4RXD">
         <value caption="RX double packet buffering is disabled for endpoint x" name="" value="0x1" />
         <value caption="RX double packet buffering is enabled for endpoint x" name="" value="0x0" />
      </value-group>
      <value-group caption="RX Endpoint 5 Double Packet Buffer Disable bits" name="USBDPBFD__EP5RXD">
         <value caption="RX double packet buffering is disabled for endpoint x" name="" value="0x1" />
         <value caption="RX double packet buffering is enabled for endpoint x" name="" value="0x0" />
      </value-group>
      <value-group caption="RX Endpoint 6 Double Packet Buffer Disable bits" name="USBDPBFD__EP6RXD">
         <value caption="RX double packet buffering is disabled for endpoint x" name="" value="0x1" />
         <value caption="RX double packet buffering is enabled for endpoint x" name="" value="0x0" />
      </value-group>
      <value-group caption="RX Endpoint 7 Double Packet Buffer Disable bits" name="USBDPBFD__EP7RXD">
         <value caption="RX double packet buffering is disabled for endpoint x" name="" value="0x1" />
         <value caption="RX double packet buffering is enabled for endpoint x" name="" value="0x0" />
      </value-group>
      <value-group caption="TX Endpoint 1 Double Packet Buffer Disable bits" name="USBDPBFD__EP1TXD">
         <value caption="TX double packet buffering is disabled for endpoint x" name="" value="0x1" />
         <value caption="TX double packet buffering is enabled for endpoint x" name="" value="0x0" />
      </value-group>
      <value-group caption="TX Endpoint 2 Double Packet Buffer Disable bits" name="USBDPBFD__EP2TXD">
         <value caption="TX double packet buffering is disabled for endpoint x" name="" value="0x1" />
         <value caption="TX double packet buffering is enabled for endpoint x" name="" value="0x0" />
      </value-group>
      <value-group caption="TX Endpoint 3 Double Packet Buffer Disable bits" name="USBDPBFD__EP3TXD">
         <value caption="TX double packet buffering is disabled for endpoint x" name="" value="0x1" />
         <value caption="TX double packet buffering is enabled for endpoint x" name="" value="0x0" />
      </value-group>
      <value-group caption="TX Endpoint 4 Double Packet Buffer Disable bits" name="USBDPBFD__EP4TXD">
         <value caption="TX double packet buffering is disabled for endpoint x" name="" value="0x1" />
         <value caption="TX double packet buffering is enabled for endpoint x" name="" value="0x0" />
      </value-group>
      <value-group caption="TX Endpoint 5 Double Packet Buffer Disable bits" name="USBDPBFD__EP5TXD">
         <value caption="TX double packet buffering is disabled for endpoint x" name="" value="0x1" />
         <value caption="TX double packet buffering is enabled for endpoint x" name="" value="0x0" />
      </value-group>
      <value-group caption="TX Endpoint 6 Double Packet Buffer Disable bits" name="USBDPBFD__EP6TXD">
         <value caption="TX double packet buffering is disabled for endpoint x" name="" value="0x1" />
         <value caption="TX double packet buffering is enabled for endpoint x" name="" value="0x0" />
      </value-group>
      <value-group caption="TX Endpoint 7 Double Packet Buffer Disable bits" name="USBDPBFD__EP7TXD">
         <value caption="TX double packet buffering is disabled for endpoint x" name="" value="0x1" />
         <value caption="TX double packet buffering is enabled for endpoint x" name="" value="0x0" />
      </value-group>
      <value-group caption="Remote Wake-up Enable bit" name="USBLPMR1__RMTWAK">
         <value caption="Remote wake-up is enabled" name="" value="0x1" />
         <value caption="Remote wake-up is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="LPM Transition to the L1 State bit" name="USBLPMR1__LPMXMT">
         <value caption="(Device mode) USB module will transition to the L1 state upon the receipt of the next LPM transaction. LPMEN must be set to 0b11. Both LPMXMT and LPMEN must be set in the same cycle. / (Host mode)USB module will transmit an LPM transaction. This bit is self clearing" name="" value="0x1" />
         <value caption="(Device and host modes) Maintain current state" name="" value="0x0" />
      </value-group>
      <value-group caption="LPM Resume bit" name="USBLPMR1__LPMRES">
         <value caption="Initiate resume (remote wake-up). Resume signaling is asserted for 50 s." name="" value="0x1" />
         <value caption="No resume operation" name="" value="0x0" />
      </value-group>
      <value-group caption="LPM Enable bits (" name="USBLPMR1__LPMEN">
         <value caption="LPM Extended transactions are supported" name="" value="0x3" />
         <value caption="LPM and Extended transactions are not supported" name="" value="0x2" />
         <value caption="LPM mode is not supported but Extended transactions are supported" name="" value="0x1" />
         <value caption="LPM Extended transactions are supported" name="" value="0x0" />
      </value-group>
      <value-group caption="LPM-only Transaction Setting bit" name="USBLPMR1__LPMNAK">
         <value caption="All endpoints will respond to all transactions other than a LPM transaction with a NAK" name="" value="0x1" />
         <value caption="Normal transaction operation" name="" value="0x0" />
      </value-group>
      <value-group caption="LPM Time-out Interrupt Enable bit" name="USBLPMR1__LPMTOIE">
         <value caption="Enable the LPMTO Interrupt" name="" value="0x1" />
         <value caption="Disable the LPMTO Interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="LPM STALL Interrupt Enable bit" name="USBLPMR1__LPMSTIE">
         <value caption="Enable the LPMST Interrupt" name="" value="0x1" />
         <value caption="Disable the LPMST Interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="LPM NYET Interrupt Enable bit" name="USBLPMR1__LPMNYIE">
         <value caption="Enable the LPMNYET Interrupt" name="" value="0x1" />
         <value caption="Disable the LPMNYET Interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="LPM Acknowledge Interrupt Enable bit" name="USBLPMR1__LPMACKIE">
         <value caption="Enable the LPMACK Interrupt" name="" value="0x1" />
         <value caption="Disable the LPMACK Interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="LPM Resume Interrupt Enable bit" name="USBLPMR1__LPMRESIE">
         <value caption="LPMRES interrupt is enabled" name="" value="0x1" />
         <value caption="LPMRES interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="LPM Error Interrupt Enable bit" name="USBLPMR1__LPMERRIE">
         <value caption="LPMERR interrupt is enabled" name="" value="0x1" />
         <value caption="LPMERR interrupt is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02831" name="USBCLKRST" version="2">
      <register-group name="USBCLKRST">
         <register caption="USB Clock/Reset Control Register" name="USBCRCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="USB Activity Detection Interrupt Enable bit" mask="0x00000001" name="USBWKUPEN" values="USBCRCON__USBWKUPEN" />
            <bitfield caption="USB Resume Interrupt Enable bit" mask="0x00000002" name="USBRIE" values="USBCRCON__USBRIE" />
            <bitfield caption="USB General Interrupt Enable bit" mask="0x00000004" name="USBIE" values="USBCRCON__USBIE" />
            <bitfield caption="Session End Vbus Monitoring for OTG Enable bit" mask="0x00000008" name="SENDMONEN" values="USBCRCON__SENDMONEN" />
            <bitfield caption="B-Device Vbus Monitoring for OTG Enable bit" mask="0x00000010" name="BSVALMONEN" values="USBCRCON__BSVALMONEN" />
            <bitfield caption="A-Device Vbus Monitoring for OTG Enable bit" mask="0x00000020" name="ASVALMONEN" values="USBCRCON__ASVALMONEN" />
            <bitfield caption="Vbus Monitoring for OTG Enable bit" mask="0x00000040" name="VBUSMONEN" values="USBCRCON__VBUSMONEN" />
            <bitfield caption="PHY ID Monitoring Enable bit" mask="0x00000080" name="PHYIDEN" values="USBCRCON__PHYIDEN" />
            <bitfield caption="USB ID Value bit" mask="0x00000100" name="USBIDVAL" values="USBCRCON__USBIDVAL" />
            <bitfield caption="USB ID Override Enable bit" mask="0x00000200" name="USBIDOVEN" values="USBCRCON__USBIDOVEN" />
            <bitfield caption="USB Activity Status bit" mask="0x01000000" name="USBWK" values="USBCRCON__USBWK" />
            <bitfield caption="USB Resume Flag bit" mask="0x02000000" name="USBRF" values="USBCRCON__USBRF" />
            <bitfield caption="USB General Interrupt Flag bit" mask="0x04000000" name="USBIF" values="USBCRCON__USBIF" />
         </register>
      </register-group>
      <value-group caption="USB Activity Detection Interrupt Enable bit" name="USBCRCON__USBWKUPEN">
         <value caption="Enable interrupt for detection of activity on USB bus in Sleep mode" name="" value="0x1" />
         <value caption="Disable interrupt for detection of activity on USB bus in Sleep mode" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Resume Interrupt Enable bit" name="USBCRCON__USBRIE">
         <value caption="Enable remote resume from suspend Interrupt" name="" value="0x1" />
         <value caption="Disable interrupt to a Remote Devices USB resume signaling" name="" value="0x0" />
      </value-group>
      <value-group caption="USB General Interrupt Enable bit" name="USBCRCON__USBIE">
         <value caption="Enables general interrupt from USB module" name="" value="0x1" />
         <value caption="Disables general interrupt from USB module" name="" value="0x0" />
      </value-group>
      <value-group caption="Session End Vbus Monitoring for OTG Enable bit" name="USBCRCON__SENDMONEN">
         <value caption="Enable monitoring for Vbus in Session End range (between 0.2V and 0.8V)" name="" value="0x1" />
         <value caption="Disable monitoring for Vbus in Session End range" name="" value="0x0" />
      </value-group>
      <value-group caption="B-Device Vbus Monitoring for OTG Enable bit" name="USBCRCON__BSVALMONEN">
         <value caption="Enable monitoring for Vbus in Session Valid range for B-device (between 0.8V and 4.0V)" name="" value="0x1" />
         <value caption="Disable monitoring for Vbus in Session Valid range for B-device" name="" value="0x0" />
      </value-group>
      <value-group caption="A-Device Vbus Monitoring for OTG Enable bit" name="USBCRCON__ASVALMONEN">
         <value caption="Enable monitoring for Vbus in Session Valid range for A-device (between 0.8V and 2.0V)" name="" value="0x1" />
         <value caption="Disable monitoring for Vbus in Session Valid range for A-device" name="" value="0x0" />
      </value-group>
      <value-group caption="Vbus Monitoring for OTG Enable bit" name="USBCRCON__VBUSMONEN">
         <value caption="Enable monitoring for Vbus in VBUS Valid range (between 4.4V and 4.75V)" name="" value="0x1" />
         <value caption="Disable monitoring for Vbus in VBUS Valid range" name="" value="0x0" />
      </value-group>
